#Задача 30:  Заполните массив элементами арифметической прогрессии. 
#Её первый элемент (A1), разность (D) и количество элементов (N) нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.


A1 = int(input("Введите первый элемент массива A1: "))
D = int(input("Введите рахность между элементами D: "))
N = int(input("Введите количество элементов массива N: "))
for i in range(N):
   print(A1+i*D, end=' ')

# for i in range(N):
#     max = 0
#     sum = berries[i] + berries[i - 1] + berries[i - 2]
#     if sum > max:
#         max = sum  
#         i += 1
# print(max)