# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону 
#(т.е. не меньше заданного минимума и не больше заданного максимума)

import random
N = int(input("Введите длинну массива (списка) N: "))
Array = list()
for i in range(N):
    i = random.randint(1,10)
    Array.append(i)
print(f'Задан массив(список) : {Array}')
Min=int(input('Введите минимальное значение диапазона для проверки : '))
Max=int(input('Введите максимальное значение диапазона для проверки : '))
print('Индексы элементов совпадения заданному диапазону:')
for i in range(len(Array)):
    if Min <= Array[i] <= Max:
        print(i, end=' ')


#Вариант с заданным списком:
# list_1 = [1,0,5,5,7,8,9]
# print(f'Задан массив(список) : {list_1}')
# Min=int(input('Введите минимальное значение диапазона для проверки : '))
# Max=int(input('Введите максимальное значение диапазона для проверки : '))
# for i in range(len(list_1)):
#     if Min <= list_1[i] <= Max:
#         print(i, end=' ')
